{
  "name": "Jim Bulkowski",
  "phone": "\\<redacted phone\\>",
  "address": {
    "line1": "\\<redacted address\\>",
    "line2": "Hoschton, GA, 30548"
  },
  "email": "jim.b@paperelectron.com",
  "social": [
    "https://linkedin.com/in/JimtotheB",
    "https://github.com/PaperElectron",
    "https://npmjs.com/~paperelectron",
    "https://twitter.com/paperElectron"
  ],
  "seeking": "Cloud Systems Architect",
  "tagline": [
    "Eleven years of professional experience developing, directing and deploying complex software applications,",
    "with a prior four years experience managing multi million dollar infrastructure projects."
  ],
  "introText": [
    "I seek to develop innovative applications, using the best tools available, in a scalable and maintainable way.",
    "I am an expert level javascript developer with experience in several other popular languages."
  ],
  "experience": [
    {
      "title": "Lead Backend/Cloud Systems Architect",
      "date": "March 2015 - Present",
      "description": [
        "Currently developing open source libraries and frameworks, primarily to support SaaS and PaaS implementations.",
        [
          "Consulting and custom implementations with a focus on highly concurrent, scalable systems and improving",
          "build, test and deploy pipelines."
        ],
        "Sundry - A caching, dynamically configurable reverse proxy, designed to power SaaS architecture.",
        "Magnum DI - A key value dependency injection framework that simplifies dependency management in generated code.",
        ["Pomegranate - a drop in application framework written in NodeJs that incorporates multiple datasources,",
          "and values extensibility."]

      ]
    },
    {
      "title": "Software Developer - Paper Electron LLC. Atlanta GA",
      "date": "June 2012 - Present",
      "description": [
        "Currently developing open source libraries and frameworks, primarily to support SaaS and PaaS implementations.",
        [
          "Consulting and custom implementations with a focus on highly concurrent, scalable systems and improving",
          "build, test and deploy pipelines."
        ],
        "Sundry - A caching, dynamically configurable reverse proxy, designed to power SaaS architecture.",
        "Magnum DI - A key value dependency injection framework that simplifies dependency management in generated code.",
        ["Pomegranate - a drop in application framework written in NodeJs that incorporates multiple datasources,",
          "and values extensibility."]

      ]
    },
    {
      "title": "Lead Architect - MVP Innovation. Atlanta GA",
      "date": "August 2014 - March 2015",
      "description": [
        "Designed and implemented a 500+ endpoint REST api, interacting with 3 different data-sources.",
        "Designed and implemented a 50k loc front end application in AngularJS.",
        "Developed a test driven design strategy, running nearly 3000 ad hoc tests on every commit from a team of 4.",
        [
          "Implemented and managed a SaaS platform comprised of a centralized router, credential arbitrator,",
          "service manager and docker container manager."
        ],
        "Managed several bare metal servers running ESXi, comprising 15+ virtual machines configured with Ansible."
      ]
    },
    {
      "title": "Development/Operations Lead - Monstercraft. Daytona Beach FL",
      "date": "January 2011 - June 2012",
      "description": [
        "Oversaw a massive baremetal JVM deployment, averaging 10TB/month network traffic, and 99%+ uptime over 18 months.",
        "Managed a 100% remote development team, producing several Java plugins for the Bukkit server platform.",
        "Managed and developed web infrastructure in PHP, including integrated user signup, payment and management.",
        "Developed a server ranking application with cryptographically secure voting."
      ]
    },
    {
      "title": "Project Manager - R&R Industries. Daytona Beach FL",
      "date": "November 2007 - January 2011",
      "description": [
        "Project managed large, fast paced, multi million dollar, construction projects",
        [
          "Managed teams of up to 20 people to ensure proper procedure,",
          "safety and quality are followed through the entirety of the project"
        ],
        "Responsible for project lifecycle including project planning, estimation, scheduling and warranty."
      ]
    }
  ],
  "languages": [
    "Javascript",
    "Go",
    "Python",
    "Java",
    "PHP",
    "Lua",
    "Ruby",
    "Bash/ZSH"
  ],
  "frameworks": [
    "NodeJs",
    "Express",
    "AngularJS",
    "React",
    "Spring",
    "Flask",
    "Laravel",
    "RoR"
  ],
  "tech": [
    "Esxi",
    "Docker",
    "Ansible",
    "CouchDB",
    "PostgreSQL",
    "Redis",
    "RabbitMQ",
    "Unix"
  ],
  "skillset": [
    "I am a lover of all things related to computing and programming, I obsessively practice my craft and take ",
    "great joy in learning and using every new framework, language and platform that comes along.",
    "DevOps is my primary hobby so I have a home network that rivals many medium businesses, along with a fairly intricate",
    "vCenter cluster at home. I also enjoy embedded programming in C and C++ on the Arduino",
    "and standalone Atmel platforms. For fun I live vicariously through my son and attempt to dream up the next big thing,",
    "so far unsuccessfully."
  ]
}